integration-tests/cases_solved/02_DECAY/01_tewn_2022-Incompressible-tewn_2022_ref33/system/fvSchemes
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object fvSchemes;
}
ddtSchemes {
    default steadyState;
}
gradSchemes {
    default cellLimited leastSquares 1;
    grad(p) cellLimited leastSquares 1;
    grad(U) cellLimited leastSquares 1;
}
divSchemes {
    default Gauss linear;
    div(phi,U) Gauss linearUpwindV grad(U);
    div(phi,k) bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(phi,omega) bounded Gauss upwind;
}
laplacianSchemes {
    default Gauss linear limited corrected 0.5;
    laplacian(nuEff,U) Gauss linear limited corrected 0.5;
    laplacian((1|A(U)),p) Gauss linear limited corrected 0.5;
    laplacian(nu,U) Gauss linear limited corrected 0.5;
}
interpolationSchemes {
    default linear;
    interpolate(HbyA) linear;
}
snGradSchemes {
    default limited 0.5;
}
fluxRequired {
    default no;
    p ;
}
wallDist {
    method meshWave;
}
